---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LevelAttrRoomComputationAutomatic
source: html/3078a2aa-2299-6cad-c74e-559ac910007a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LevelAttrRoomComputationAutomatic Property

"Automatic Room Computation Height"

## Syntax (C#)
```csharp
public static ForgeTypeId LevelAttrRoomComputationAutomatic { get; }
```